Beam and Slab Analytical Models do not have the same Analytical Projection Plane.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AnalyticalBeamSlabWarning { get; }
  Visual Basic
Public Shared ReadOnly Property AnalyticalBeamSlabWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AnalyticalBeamSlabWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace